ankuns/nrfx/bsp/stable/mdk/nrf7140_bbpr.svd
          <register>
            <name>GPUDRAWPT1X</name>
            <description>X coordinate of vertex 1 drawing primitive. The value is 16.16 fixed point.</description>
            <addressOffset>0x130</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>X</name>
                <description>Specifies the X coordinate of vertex 1 drawing primitive (16.16 fixed point)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWPT1Y</name>
            <description>Y coordinate of vertex 1 drawing primitive. The value is 16.16 fixed point.</description>
            <addressOffset>0x134</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Y</name>
                <description>Specifies the Y coordinate of vertex 1 drawing primitive (16.16 fixed point)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUBYPASSADDR</name>
            <description>Address of bypass mode of rasterizer setup access</description>
            <addressOffset>0x138</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUBYPASSADDR</name>
                <description>Address of bypass mode of rasterizer setup access</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BYPASSDATA</name>
            <description>Data and enable of bypass mode of rasterizer</description>
            <addressOffset>0x13C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUBYPASSDATA</name>
                <description>Data and enable of bypass mode of rasterizer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWPT2X</name>
            <description>X coordinate of vertex 2 drawing primitive. The value is 16.16 fixed point</description>
            <addressOffset>0x140</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>X</name>
                <description>Specifies the X coordinate of vertex 2 drawing primitive (16.16 fixed point)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWPT2Y</name>
            <description>Y coordinate of vertex 2 drawing primitive. The value is 16.16 fixed point</description>
            <addressOffset>0x144</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Y</name>
                <description>Specifies the Y coordinate of vertex 2 drawing primitive (16.16 fixed point)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCLID</name>
            <description>Command List ID Key</description>
            <addressOffset>0x148</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLID</name>
                <description>Specifies the last executed command list</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWPT3X</name>
            <description>X coordinate of vertex 3 drawing primitive. The value is 16.16 fixed point</description>
            <addressOffset>0x150</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>X</name>
                <description>Specifies the X coordinate of vertex 3 drawing primitive (16.16 fixed point)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWPT3Y</name>
            <description>Y coordinate of vertex 3 drawing primitive. The value is 16.16 fixed point</description>
            <addressOffset>0x154</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Y</name>
                <description>Specifies the Y coordinate of vertex 3 drawing primitive (16.16 fixed point)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCLIPMIN1</name>
            <description>Second Clipping Rectangle upper left vertex</description>
            <addressOffset>0x158</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLIPMINX</name>
                <description>Define the upper left X coordinate</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CLIPMINY</name>
                <description>Define the upper left Y coordinate</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCLIPMAX1</name>
            <description>Second Clipping Rectangle bottom right vertex</description>
            <addressOffset>0x15C</addressOffset>
            <access>read-write</access>
            <resetValue>0x7FFF7FFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLIPMAXX</name>
                <description>Define the bottom left X coordinate</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CLIPMAXY</name>
                <description>Define the bottom left Y coordinate</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUMM00</name>
            <description>(0,0) matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x160</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MM00</name>
                <description>Specifies the (0,0) element</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUMM00POS21LEN11</name>
                <lsb>21</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUMM01</name>
            <description>(0,1) matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x164</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MM01</name>
                <description>Specifies the (0,1) element</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUMM01POS21LEN11</name>
                <lsb>21</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUMM02</name>
            <description>(0,2) matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x168</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MM02</name>
                <description>Specifies the (0,2) element</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUMM02POS21LEN11</name>
                <lsb>21</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUMM10</name>
            <description>(1,0) matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x16C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MM10</name>
                <description>Specifies the (1,0) element</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUMM10POS21LEN11</name>
                <lsb>21</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUMM11</name>
            <description>(1,1) matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x170</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MM11</name>
                <description>Specifies the (1,1) element</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUMM11POS21LEN11</name>
                <lsb>21</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUMM12</name>
            <description>(1,2) matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x174</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MM12</name>
                <description>Specifies the (1,2) element</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUMM12POS21LEN11</name>
                <lsb>21</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUMM20</name>
            <description>(2,0) matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x178</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MM20</name>
                <description>Specifies the (2,0) element</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUMM20POS21LEN11</name>
                <lsb>21</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUMM21</name>
            <description>(2,1) matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x17C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MM21</name>
                <description>Specifies the (2,1) element</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUMM21POS21LEN11</name>
                <lsb>21</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUMM22</name>
            <description>(2,2) matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x180</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MM22</name>
                <description>Specifies the (2,2) element</description>
                <lsb>0</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>GPUMM22POS21LEN11</name>
                <lsb>21</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDEPTHSTARTL</name>
            <description>Depth value of the STARTXY pixel. This register defines the</description>
            <addressOffset>0x184</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTL</name>
                <description>Specifies the fractional part of the depth value of the STARTXY pixel</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDEPTHSTARTH</name>
            <description>Depth value of the STARTXY pixel. This register defines the</description>
            <addressOffset>0x188</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTH</name>
                <description>Specifies the integral value of the depth value of the STARTXY pixel</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDEPTHDXL</name>
            <description>For each step at x-axis, depth value is added.</description>
            <addressOffset>0x18C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DXL</name>
                <description>Specifies the fractional part of the added depth value for each step at x-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDEPTHDXH</name>
            <description>For each step at x-axis, depth value is added.</description>
            <addressOffset>0x190</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DXH</name>
                <description>Specifies the integral part of the added depth value for each step at x-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDEPTHDYL</name>
            <description>For each step at y-axis, depth value is added.</description>
            <addressOffset>0x194</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DYL</name>
                <description>Specifies the fractional part of the added depth value for each step at y-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDEPTHDYH</name>
            <description>For each step at y-axis, depth value is added.</description>
            <addressOffset>0x198</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DYH</name>
                <description>Specifies the integral part of the added depth value for each step at y-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUREDDX</name>
            <description>For each step at x-axis, Red (R) value is added.</description>
            <addressOffset>0x1A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DX</name>
                <description>Specifies the added Red (R) value for each step at x-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUREDDY</name>
            <description>For each step at y-axis, Red (R) value is added.</description>
            <addressOffset>0x1A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DY</name>
                <description>Specifies the added Red (R) value for each step at y-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUGREDX</name>
            <description>For each step at x-axis, Green (G) value is added.</description>
            <addressOffset>0x1A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DX</name>
                <description>Specifies the added Green (G) value for each step at x-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUGREDY</name>
            <description>For each step at y-axis, Green (G) value is added.</description>
            <addressOffset>0x1AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DY</name>
                <description>Specifies the added Green (G) value for each step at y-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUBLUDX</name>
            <description>For each step at x-axis, Blue (B) value is added.</description>
            <addressOffset>0x1B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DX</name>
                <description>Specifies the added Blue (B) value for each step at x-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUBLUDY</name>
            <description>For each step at y-axis, Blue (B) value is added.</description>
            <addressOffset>0x1B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DY</name>
                <description>Specifies the added Blue (B) value for each step at y-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUALFDX</name>
            <description>For each step at x-axis, Alpha (A) value is added.</description>
            <addressOffset>0x1B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DX</name>
                <description>Specifies the added Alpha (A) value for each step at x-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUALFDY</name>
            <description>For each step at y-axis, Alpha (A) value is added.</description>
            <addressOffset>0x1BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DY</name>
                <description>Specifies the added Alpha (A) value for each step at y-axis</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUREDINIT</name>
            <description>Red (R) value of the STARTXY pixel. The value is 16,16 fixed point</description>
            <addressOffset>0x1C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INIT</name>
                <description>Specifies the Red (R) value of the STARTXY pixel</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
