ankuns/nrfx/bsp/stable/mdk/nrf7140_bbpr.svd
          <register>
            <name>PRESETUHS2R</name>
            <description>This register is used to hold the preset value for UHS-II and HS400 speed modes in the SD and eMMC modes, respectively.</description>
            <addressOffset>0x074</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>FREQSELVAL</name>
                <description>SDCLK/RCLK Frequency Select Value</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CLKGENSELVAL</name>
                <description>Clock Generator Select Value</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Host Controller Ver2.0 Compatible Clock Generator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PROG</name>
                    <description>Programmable Clock Generator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1311</name>
                <description>These bits of UHS-II Preset register are reserved. They always return 0.</description>
                <lsb>11</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DRVSELVAL</name>
                <description>Driver Strength Select Value</description>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TYPEB</name>
                    <description>Driver Type B is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEA</name>
                    <description>Driver Type A is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPEC</name>
                    <description>Driver Type C is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TYPED</name>
                    <description>Driver Type D is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PEMBEDDEDCNTR</name>
            <description>This register points to the location of UHS-II embedded control registers.</description>
            <addressOffset>0x0E6</addressOffset>
            <access>read-write</access>
            <resetValue>0x0F6C</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>REGOFFSETADDR</name>
                <description>Offset Address of Embedded Control register.</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PVENDORSPECIFICAREA</name>
            <description>This register used as a pointer for the Vendor Specific Area 1.</description>
            <addressOffset>0x0E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x0500</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>REGOFFSETADDR</name>
                <description>Base offset Address for Vendor-Specific registers.</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PVENDOR2SPECIFICAREA</name>
            <description>This register is used as a pointer for the Vendor Specific Area 2.</description>
            <addressOffset>0x0EA</addressOffset>
            <access>read-write</access>
            <resetValue>0x0180</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>REGOFFSETADDR</name>
                <description>Base offset Address for Command Queuing registers.</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SLOTINTRSTATUSR</name>
            <description>This register indicates the Interrupt status of each slot.</description>
            <addressOffset>0x0FC</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>INTRSLOT</name>
                <description>Interrupt signal for each Slot</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HOSTCNTRLVERSR</name>
            <description>This register is used to indicate the Host Controller Version number.</description>
            <addressOffset>0x0FE</addressOffset>
            <access>read-write</access>
            <resetValue>0x0005</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>SPECVERSIONNUM</name>
                <description>Specification Version Number</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VER100</name>
                    <description>SD Host Controller Specification Version 1.00</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VER200</name>
                    <description>SD Host Controller Specification Version 2.00</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VER300</name>
                    <description>SD Host Controller Specification Version 3.00</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VER400</name>
                    <description>SD Host Controller Specification Version 4.00</description>
                    <value>0x03</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VER410</name>
                    <description>SD Host Controller Specification Version 4.10</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VER420</name>
                    <description>SD Host Controller Specification Version 4.20</description>
                    <value>0x05</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VENDORVERSIONNUM</name>
                <description>Vendor Version Number</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>VENDOR2</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SDCARD_VENDOR2</headerStructName>
          <access>read-write</access>
          <addressOffset>0x780</addressOffset>
          <register>
            <name>QCAP</name>
            <description>This register indicates the capabilities of the command queuing engine.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x000030C8</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ITCFVAL</name>
                <description>Internal Timer Clock Frequency Value (ITCFVAL)</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CQCCAPRSVD1</name>
                <description>These bits of the CQCAP register are reserved. They always return 0.</description>
                <lsb>10</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ITCFMUL</name>
                <description>Internal Timer Clock Frequency Multiplier (ITCFMUL)</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLK1KHZ</name>
                    <description>1KHz clock</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLK10KHZ</name>
                    <description>10KHz clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLK100KHZ</name>
                    <description>100KHz clock</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLK1MHZ</name>
                    <description>1MHz clock</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLK10MHZ</name>
                    <description>10MHz clock</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CQCCAPRSVD2</name>
                <description>These bits [27:16] of the CQCAP register are reserved. They always return 0.</description>
                <lsb>16</lsb>
                <msb>27</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CRYPTOSUPPORT</name>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Crypto not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Crypto Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CQCCAPRSVD3</name>
                <description>These bits [31:29] of the CQCAP register are reserved. They always return 0.</description>
                <lsb>29</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PHY</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SDCARD_PHY</headerStructName>
          <access>read-write</access>
          <addressOffset>0x900</addressOffset>
          <register>
            <name>PHYCNFG</name>
            <description>SD/eMMC PHY general configuration register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYRSTN</name>
                <description>Active-Low reset control for PHY, write '0' to reset PHY, Write '1' to deassert reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>PHYPWRGOOD</name>
                <description>Phy's Power Good status is captured here. Ensure this is '1' before stating transactions.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PADSP</name>
                <description>PMOS TX drive strength control. Common config for all for SD/eMMC Pads.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>PADSN</name>
                <description>NMOS TX drive strength control. Common config for all for SD/eMMC Pads.</description>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MDPADCNFG</name>
            <description>SD/eMMC PHY's Command/Response PAD settings are controlled here</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x0440</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>RXSEL</name>
                <description>Reciver type select for PAD. Controls the RXSEL value of SD/eMMC PHY CMD PAD</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WEAKPULLEN</name>
                <description>Pull-up/Pul-down enable control for CMD PAD</description>
                <lsb>3</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Pull-up and pull-down functionality disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULLUP</name>
                    <description>Weak pull up enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULLDOWN</name>
                    <description>Weak pull down enabled</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ILLEGAL</name>
                    <description>Should not be used</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXSLEWCTRLP</name>
                <description>Slew control for P-Type CMD Pad's TX</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TXSLEWCTRLN</name>
                <description>Slew control for N-Type CMD Pad's TX</description>
                <lsb>9</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATPADCNFG</name>
            <description>SD/eMMC PHY's Data PAD settings are controlled here. common settings for all data pads</description>
            <addressOffset>0x006</addressOffset>
            <access>read-write</access>
            <resetValue>0x0440</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>RXSEL</name>
                <description>Reciver type select for PAD. Controls the RXSEL value of SD/eMMC PHY DATA PADs</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WEAKPULLEN</name>
                <description>Pull-up/Pull-down enable control for DATA PADs</description>
                <lsb>3</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Pull-up and pull-down functionality disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULLUP</name>
                    <description>Weak pull up enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULLDOWN</name>
                    <description>Weak pull down enabled</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ILLEGAL</name>
                    <description>Should not be used</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXSLEWCTRLP</name>
                <description>Slew control for P-Type DATA Pad's TX</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TXSLEWCTRLN</name>
                <description>Slew control for N-Type DATA Pad's TX</description>
                <lsb>9</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PADCNFG</name>
            <description>SD/eMMC PHY's CLK PAD settings are controlled here.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x0440</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>RXSEL</name>
                <description>Reciver type select for PAD. Controls the RXSEL value of SD/eMMC PHY CLK PAD</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WEAKPULLEN</name>
                <description>Pull-up/Pul-down enable control for CLK PAD</description>
                <lsb>3</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Pull-up and pull-down functionality disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULLUP</name>
                    <description>Weak pull up enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULLDOWN</name>
                    <description>Weak pull down enabled</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ILLEGAL</name>
                    <description>Should not be used</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXSLEWCTRLP</name>
                <description>Slew control for P-Type CLK Pad's TX</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TXSLEWCTRLN</name>
                <description>Slew control for N-Type CLK Pad's TX</description>
                <lsb>9</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STBPADCNFG</name>
            <description>SD/eMMC PHY's Strobe PAD settings are controlled here.</description>
            <addressOffset>0x00A</addressOffset>
            <access>read-write</access>
            <resetValue>0x0440</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>RXSEL</name>
                <description>Reciver type select for PAD. Controls the RXSEL value of SD/eMMC PHY STROBE PAD</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WEAKPULLEN</name>
                <description>Pull-up/Pul-down enable control for STROBE PAD</description>
                <lsb>3</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Pull-up and pull-down functionality disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULLUP</name>
                    <description>Weak pull up enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULLDOWN</name>
                    <description>Weak pull down enabled</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ILLEGAL</name>
                    <description>Should not be used</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXSLEWCTRLP</name>
                <description>Slew control for P-Type Strobe Pad's TX</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TXSLEWCTRLN</name>
                <description>Slew control for N-Type Strobe Pad's TX</description>
                <lsb>9</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
