ankuns/nrfx/bsp/stable/mdk/nrf7140_bbpr.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_LRCCONF_SDCARD</name>
      <description>LRCCONF</description>
      <baseAddress>0x4F8CA000</baseAddress>
      <headerStructName>LRCCONF</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>LRCCONF</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_REQCLKSRC[%s]</name>
          <description>Description collection: Request the clock source for clock [n]</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_REQCLKSRC</name>
              <description>Request the clock source for clock [n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_STOPREQCLKSRC[%s]</name>
          <description>Description collection: Stop requesting the clock source for clock [n]</description>
          <addressOffset>0x020</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOPREQCLKSRC</name>
              <description>Stop requesting the clock source for clock [n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>TASKS_CONSTLAT</name>
          <description>Peripheral tasks.</description>
          <headerStructName>GLOBAL_LRCCONF_TASKS_CONSTLAT</headerStructName>
          <access>write-only</access>
          <addressOffset>0x040</addressOffset>
          <register>
            <name>ENABLE</name>
            <description>Enable constant latency mode</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable constant latency mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Trigger</name>
                    <description>Trigger task</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLE</name>
            <description>Disable constant latency mode</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DISABLE</name>
                <description>Disable constant latency mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Trigger</name>
                    <description>Trigger task</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TASKS_SYSTEMOFF</name>
          <description>Peripheral tasks.</description>
          <headerStructName>GLOBAL_LRCCONF_TASKS_SYSTEMOFF</headerStructName>
          <access>write-only</access>
          <addressOffset>0x048</addressOffset>
          <register>
            <name>NOTREADY</name>
            <description>Not ready to go to System OFF</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOTREADY</name>
                <description>Not ready to go to System OFF</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Trigger</name>
                    <description>Trigger task</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>READY</name>
            <description>Ready to go to System OFF</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>READY</name>
                <description>Ready to go to System OFF</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Trigger</name>
                    <description>Trigger task</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TASKS_REQHFXO</name>
          <description>Request HFXO</description>
          <addressOffset>0x050</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_REQHFXO</name>
              <description>Request HFXO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOPREQHFXO</name>
          <description>Stop requesting HFXO</description>
          <addressOffset>0x054</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOPREQHFXO</name>
              <description>Stop requesting HFXO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_CLKSRCSTARTED[%s]</name>
          <description>Description collection: Clock source is started for clock [n]</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_CLKSRCSTARTED</name>
              <description>Clock source is started for clock [n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_HFXOSTARTED</name>
          <description>HFXO is started</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_HFXOSTARTED</name>
              <description>HFXO is started</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>CLKSTAT[%s]</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_LRCCONF_CLKSTAT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>RUN</name>
            <description>Description cluster: Status indicating that TASKS_REQCLKSRC task has been triggered for clock [n].</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STATUS</name>
                <description>Clock start task triggered or not</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotTriggered</name>
                    <description>Task not triggered</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Triggered</name>
                    <description>Task triggered</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>Description cluster: Status indicating clock source for clock [n]</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SRC</name>
                <description>Clock source status</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OpenLoop</name>
                    <description>Open loop.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ClosedLoop</name>
                    <description>Closed loop.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASS</name>
                <description>Clock source bypass status</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Clock source bypass is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Clock source bypass is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>CLKCTRL[%s]</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_LRCCONF_CLKCTRL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <name>ALWAYSRUN</name>
            <description>Description cluster: Force the clock [n] and tree running always</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FORCE</name>
                <description>Force the clock always running</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Automatic</name>
                    <description>Automatic clock control enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AlwaysRun</name>
                    <description>Clock always running</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>Description cluster: Select the clock source for clock [n]</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SRC</name>
                <description>Clock source</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OpenLoop</name>
                    <description>Open loop.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ClosedLoop</name>
                    <description>Closed loop.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASS</name>
                <description>Clock source bypass</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable the clock source bypass</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable the clock source bypass</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CONSTLATSTAT</name>
          <description>Status of constant latency</description>
          <addressOffset>0x480</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Constant latency disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Constant latency enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
