ankuns/nrfx/bsp/stable/mdk/nrf7140_bbpr.svd
        <cluster>
          <name>CORE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_QSPI_CORE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x900</addressOffset>
          <cluster>
            <name>CORE</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_QSPI_CORE_CORE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>CTRLR0</name>
              <description>Control Register 0</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000007</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DFS</name>
                  <description>Data Frame Size.</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DFS04BIT</name>
                      <description>04-bit serial data transfer</description>
                      <value>0x03</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS05BIT</name>
                      <description>05-bit serial data transfer</description>
                      <value>0x04</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS06BIT</name>
                      <description>06-bit serial data transfer</description>
                      <value>0x05</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS07BIT</name>
                      <description>07-bit serial data transfer</description>
                      <value>0x06</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS08BIT</name>
                      <description>08-bit serial data transfer</description>
                      <value>0x07</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS09BIT</name>
                      <description>09-bit serial data transfer</description>
                      <value>0x08</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS10BIT</name>
                      <description>10-bit serial data transfer</description>
                      <value>0x09</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS11BIT</name>
                      <description>11-bit serial data transfer</description>
                      <value>0x0A</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS12BIT</name>
                      <description>12-bit serial data transfer</description>
                      <value>0x0B</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS13BIT</name>
                      <description>13-bit serial data transfer</description>
                      <value>0x0C</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS14BIT</name>
                      <description>14-bit serial data transfer</description>
                      <value>0x0D</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS15BIT</name>
                      <description>15-bit serial data transfer</description>
                      <value>0x0E</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS16BIT</name>
                      <description>16-bit serial data transfer</description>
                      <value>0x0F</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS17BIT</name>
                      <description>17-bit serial data transfer</description>
                      <value>0x10</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS18BIT</name>
                      <description>18-bit serial data transfer</description>
                      <value>0x11</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS19BIT</name>
                      <description>19-bit serial data transfer</description>
                      <value>0x12</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS20BIT</name>
                      <description>20-bit serial data transfer</description>
                      <value>0x13</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS21BIT</name>
                      <description>21-bit serial data transfer</description>
                      <value>0x14</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS22BIT</name>
                      <description>22-bit serial data transfer</description>
                      <value>0x15</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS23BIT</name>
                      <description>23-bit serial data transfer</description>
                      <value>0x16</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS24BIT</name>
                      <description>24-bit serial data transfer</description>
                      <value>0x17</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS25BIT</name>
                      <description>25-bit serial data transfer</description>
                      <value>0x18</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS26BIT</name>
                      <description>26-bit serial data transfer</description>
                      <value>0x19</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS27BIT</name>
                      <description>27-bit serial data transfer</description>
                      <value>0x1A</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS28BIT</name>
                      <description>28-bit serial data transfer</description>
                      <value>0x1B</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS29BIT</name>
                      <description>29-bit serial data transfer</description>
                      <value>0x1C</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS30BIT</name>
                      <description>30-bit serial data transfer</description>
                      <value>0x1D</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS31BIT</name>
                      <description>31-bit serial data transfer</description>
                      <value>0x1E</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS32BIT</name>
                      <description>32-bit serial data transfer</description>
                      <value>0x1F</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDCTRLR05</name>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FRF</name>
                  <description>Frame Format.</description>
                  <lsb>6</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SPI</name>
                      <description>Motorola SPI Frame Format</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SSP</name>
                      <description>Texas Instruments SSP Frame Format</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MICROWIRE</name>
                      <description>National Semiconductors Microwire Frame Format</description>
                      <value>0x2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SCPH</name>
                  <description>Serial Clock Phase.</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MIDDLEBIT</name>
                      <description>Serial clock toggles in middle of first bit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>STARTBIT</name>
                      <description>Serial clock toggles at start of first bit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SCPOL</name>
                  <description>Serial Clock Polarity.</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVEHIGH</name>
                      <description>Inactive state of serial clock is low</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INACTIVELOW</name>
                      <description>Inactive state of serial clock is high</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TMOD</name>
                  <description>Transfer Mode.</description>
                  <lsb>10</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TXANDRX</name>
                      <description>Transmit &amp;amp; Receive; Not Applicable in enhanced SPI operating mode or when SSIC_HAS_TX_RX_EN is set to 0</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TXONLY</name>
                      <description>Transmit only mode; Or Write in enhanced SPI operating mode</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RXONLY</name>
                      <description>Receive  only mode; Or Read in enhanced SPI operating mode</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EEPROMREAD</name>
                      <description>EEPROM  Read  mode; Not Applicable in enhanced SPI operating mode</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SLVOE</name>
                  <description>Target Output Enable.</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Target Output is enabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Target Output is disabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SRL</name>
                  <description>Shift Register Loop.</description>
                  <lsb>13</lsb>
                  <msb>13</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NORMALMODE</name>
                      <description>Normal mode operation</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TESTINGMODE</name>
                      <description>Test Mode Operation</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SSTE</name>
                  <description>Target Select Toggle Enable.</description>
                  <lsb>14</lsb>
                  <msb>14</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TOGGLEDISABLE</name>
                      <description>ss_*_n will stay low and sclk will run continuously for the duration of the transfer</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TOGGLEEN</name>
                      <description>ss_*_n line will toggle between consecutive data frames, with the serial clock (sclk) being held to its default value while ss_*_n is high</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDCTRLR015</name>
                  <lsb>15</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CFS</name>
                  <description>Control Frame Size.</description>
                  <lsb>16</lsb>
                  <msb>19</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SIZE01BIT</name>
                      <description>01-bit Control Word</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE02BIT</name>
                      <description>02-bit Control Word</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE03BIT</name>
                      <description>03-bit Control Word</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE04BIT</name>
                      <description>04-bit Control Word</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE05BIT</name>
                      <description>05-bit Control Word</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE06BIT</name>
                      <description>06-bit Control Word</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE07BIT</name>
                      <description>07-bit Control Word</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE08BIT</name>
                      <description>08-bit Control Word</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE09BIT</name>
                      <description>09-bit Control Word</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE10BIT</name>
                      <description>10-bit Control Word</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE11BIT</name>
                      <description>11-bit Control Word</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE12BIT</name>
                      <description>12-bit Control Word</description>
                      <value>0xB</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE13BIT</name>
                      <description>13-bit Control Word</description>
                      <value>0xC</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE14BIT</name>
                      <description>14-bit Control Word</description>
                      <value>0xD</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE15BIT</name>
                      <description>15-bit Control Word</description>
                      <value>0xE</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE16BIT</name>
                      <description>16-bit Control Word</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDCTRLR02021</name>
                  <lsb>20</lsb>
                  <msb>21</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPIFRF</name>
                  <description>SPI Frame Format</description>
                  <lsb>22</lsb>
                  <msb>23</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SPISTANDARD</name>
                      <description>Standard SPI Format</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPIDUAL</name>
                      <description>Dual SPI Format</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPIQUAD</name>
                      <description>Quad SPI Format</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPIOCTAL</name>
                      <description>Octal SPI Format</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SPIHYPERBUSEN</name>
                  <description>SPI Hyperbus Frame format enable.</description>
                  <lsb>24</lsb>
                  <msb>24</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Disable Hyperbus Format</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLE</name>
                      <description>Enable Hyperbus Format</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SPIDWSEN</name>
                  <description>Enable Dynamic wait states in SPI mode of operation. This field is only applicable when CTRLR0.FRF is set to 0 (Motorola SPI Frame Format).</description>
                  <lsb>25</lsb>
                  <msb>25</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Disable SPI Dynamic Wait State</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLE</name>
                      <description>Enable SPI Dynamic Wait State</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CLKLOOPEN</name>
                  <description>Clock loop back enable bit. Once this bit is set to 1, QSPI CORE will use looped back clock (mst_sclk_in) to capture read data</description>
                  <lsb>26</lsb>
                  <msb>26</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Disable Clock Loop Back</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLE</name>
                      <description>Enable Clock Loop Back</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDCTRLR02730</name>
                  <lsb>27</lsb>
                  <msb>30</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SSIISMST</name>
                  <description>This field selects if QSPI CORE is working in Controller or Target mode</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TARGET</name>
                      <description>QSPI CORE is Target</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CONTROLLER</name>
                      <description>QSPI CORE is Controller</description>
                      <value>0x1</value>
                    </enumeratedValue>
